# ооооооо=input()
# if ооооооо=="Алёна" or ооооооо=="Алена" or ооооооо=="алена" or ооооооо=="алёна" or ооооооо=="алиса" or ооооооо=="Алиса" or ооооооо=="ира" or ооооооо=="Ира":
#     print(f"привет {ооооооо}")
# elif ооооооо=="secret":
#     print("на русском говори")
# else:
#     print("привет незнакомец")



# ok=input('один растёт другой льёт')
# if ok=="Трова, дождь." or ok=="Трова дождь" or ok=="трова дождь" or ok=="трова, дождь." or ok=="растение, жидкость." or ok=="растение жидкость.":
#     print("правильно молодец!")
# else:
#     print("неправильно попробуй ещё раз.")



скорость=int(input("Введите скорость автомобиля"))
расстояние=int(input("Введите расстояние точки А до точки Б"))
время=расстояние / скорость
print(время)